# 2. Data Indexing

Dieses Notebook klärt folgende Fragen:
- Wie kann ich Daten einlesen?
- Wie kann ich die eingelesenen Daten anzeigen?
- Wie kann ich die Datentypen der einzelnen Merkmale (Variablen) anzeigen?
- Indexierung: Wie greife ich auf einzelne Elemente des Datensatzes zu?
- Indexierung bei Zeitreihen: Wie kann ich auf elegante Art und Weise mit Zeitstempeln arbeiten?

Hilfreich bei der Bearbeitung ist das Cheat Sheet, welches die wichtigsten grundlegenden Python Befehle zur Datenanalyse zusammenfasst. Sie finden das Cheat Sheet auf ILIAS.

## Benötigte Bibliothek pandas einbinden

In [2]:
# Importieren sie die Bibliothek pandas, vergeben Sie dazu das Kürzel pd
import pandas as pd

## Daten einlesen über Pandas Funktion pd.read_csv('Pfadname')

In [3]:
# Lesen Sie datensatz1.csv ein
df = pd.read_csv('./data/datensatz1.csv')

In [180]:
# Die Anzahl der Zeilen und Spalten des data frames kann über das Attribut shape ausgegeben werden: 
df.shape

(2187, 4)

In [181]:
# die Datentypen der einzelnen Spalten können mit dtypes angezeigt werden (bitte vervollständigen):
df.dtypes

Date            object
Consumption    float64
Wind           float64
Solar          float64
dtype: object

In [182]:
# ersten paar Zeilen anzeigen mit head():
df.head(5)

         Date  Consumption     Wind   Solar
0  2012-01-01      948.128  227.465   6.587
1  2012-01-02     1269.581  207.327   6.574
2  2012-01-03     1334.745  473.468  24.679
3  2012-01-04     1347.136  499.804  14.681
4  2012-01-05     1376.658  523.851   5.071

In [183]:
# letzten paar Zeilen anzeigen mit tail():
df.tail(5)

            Date  Consumption     Wind   Solar
2182  2017-12-27   1263.94091  394.507  16.530
2183  2017-12-28   1299.86398  506.424  14.162
2184  2017-12-29   1295.08753  584.277  29.854
2185  2017-12-30   1215.44897  721.247   7.467
2186  2017-12-31   1107.11488  721.176  19.980

In [184]:
# 7 zufällige Zeilen ausgeben:
df.sample(7)

            Date  Consumption     Wind    Solar
2186  2017-12-31   1107.11488  721.176   19.980
1442  2015-12-18   1462.44300  328.025   13.020
286   2012-10-13   1121.49900  156.457   82.872
182   2012-07-01    980.69500   86.751   90.800
1742  2016-10-13   1503.57100  331.642   53.251
862   2014-05-17   1206.49900   68.244  135.701
1934  2017-04-23   1156.94600  393.913  130.111

## Indexierung mit Zeilen- und Spaltennummer
- Funktioniert mit data.iloc[Zeilenindex, Spaltenindex]

In [185]:
# Wert in Zeile 1, Spalte 3 ausgeben
df.iloc[0, 2]

227.4650000000001

In [186]:
# Wert in letzter Zeile, Spalte 3 ausgeben
df.iloc[-1, 2]

721.1760000000003

In [187]:
# zur Kontrolle tail()
df.tail()

            Date  Consumption     Wind   Solar
2182  2017-12-27   1263.94091  394.507  16.530
2183  2017-12-28   1299.86398  506.424  14.162
2184  2017-12-29   1295.08753  584.277  29.854
2185  2017-12-30   1215.44897  721.247   7.467
2186  2017-12-31   1107.11488  721.176  19.980

In [188]:
# 1. Zeile ausgeben
df.iloc[0]

Date           2012-01-01
Consumption       948.128
Wind              227.465
Solar               6.587
Name: 0, dtype: object

In [189]:
# 2. Spalte ausgeben
df.iloc[:, 1]

0        948.12800
1       1269.58100
2       1334.74500
3       1347.13600
4       1376.65800
           ...
2182    1263.94091
2183    1299.86398
2184    1295.08753
2185    1215.44897
2186    1107.11488
Name: Consumption, Length: 2187, dtype: float64

In [190]:
# zur Kontrolle head()
df.head()

         Date  Consumption     Wind   Solar
0  2012-01-01      948.128  227.465   6.587
1  2012-01-02     1269.581  207.327   6.574
2  2012-01-03     1334.745  473.468  24.679
3  2012-01-04     1347.136  499.804  14.681
4  2012-01-05     1376.658  523.851   5.071

In [191]:
# Zeilen mit den Indizes 5 bis 15 ausgeben
df.iloc[5:16]

          Date  Consumption     Wind   Solar
5   2012-01-06     1291.215  286.265  13.160
6   2012-01-07     1175.688  368.288   4.115
7   2012-01-08     1103.383  220.851   8.440
8   2012-01-09     1443.371  151.837   5.264
9   2012-01-10     1434.631  175.995  17.827
10  2012-01-11     1449.768  197.434  10.849
11  2012-01-12     1442.448  446.327  18.023
12  2012-01-13     1403.402  415.106  18.778
13  2012-01-14     1203.165  174.690  26.772
14  2012-01-15     1150.920   34.468  36.609
15  2012-01-16     1487.782   52.345  39.682

In [192]:
# Zeilen 5 bis 15 von Spalten 1 bis 3 ausgeben
df.iloc[5:16, 0:3]

          Date  Consumption     Wind
5   2012-01-06     1291.215  286.265
6   2012-01-07     1175.688  368.288
7   2012-01-08     1103.383  220.851
8   2012-01-09     1443.371  151.837
9   2012-01-10     1434.631  175.995
10  2012-01-11     1449.768  197.434
11  2012-01-12     1442.448  446.327
12  2012-01-13     1403.402  415.106
13  2012-01-14     1203.165  174.690
14  2012-01-15     1150.920   34.468
15  2012-01-16     1487.782   52.345

## Zeitstempel als Index setzen
Da eine Indexierung über Zeilen- und Spaltennummer bei dem Datensatz eher umständlich ist, wollen wir lieber über das Datum und den Spaltennamen gehen. 
Dazu setzen wir den Zeitstempel als Index und verwenden später diesen anstatt der Zeilennummer

In [193]:
# 1. Schritt (optional): Erzeuge ein neues Data Frame mit einer Kopie der Rohdaten. Das neue data frame wird data genannt.
df_copy = df.copy()

# 2. Schritt: Ändere im neuen data frame das Format der Spalte 'Date' zu datetimes.
df_copy['Date'] = pd.to_datetime(df_copy['Date'])

In [194]:
# Überprüfe, ob die Umwandlung geklappt hat
print('Rohdatensatz:')
print(df['Date'].head(), '\n')

print('Neuer Datensatz:')
print(df_copy['Date'].head(),'\n')

print('Alle Datentypen des Datensatzes:')
print(df_copy.dtypes)

Rohdatensatz:
0    2012-01-01
1    2012-01-02
2    2012-01-03
3    2012-01-04
4    2012-01-05
Name: Date, dtype: object

Neuer Datensatz:
0   2012-01-01
1   2012-01-02
2   2012-01-03
3   2012-01-04
4   2012-01-05
Name: Date, dtype: datetime64[ns]

Alle Datentypen des Datensatzes:
Date           datetime64[ns]
Consumption           float64
Wind                  float64
Solar                 float64
dtype: object

In [195]:
# 3. Schritt: Setze die Spalte 'Date' als neuen Index:
df_copy.set_index('Date', inplace=True)

# Überprüfen durch Ausgabe der ersten Spalten des data frames:
df_copy.iloc[:, 0:2].head()

            Consumption     Wind
Date
2012-01-01      948.128  227.465
2012-01-02     1269.581  207.327
2012-01-03     1334.745  473.468
2012-01-04     1347.136  499.804
2012-01-05     1376.658  523.851

## Mit Zeitstempel indexieren

In [208]:
# Alle Daten aus dem Jahr 2013:
df_copy.loc['2013']

            Consumption     Wind   Solar
Date
2013-01-01      906.910  262.438  14.218
2013-01-02     1160.174  224.867  26.010
2013-01-03     1199.565  387.143   6.058
2013-01-04     1198.952  342.443   4.976
2013-01-05     1108.271  140.410   4.970
...                 ...      ...     ...
2013-12-27     1166.552  395.736  41.011
2013-12-28     1089.790  208.514  21.028
2013-12-29     1031.149  213.978  20.933
2013-12-30     1149.097  254.119  47.097
2013-12-31     1068.429  174.670  43.219

[363 rows x 3 columns]

In [232]:
# Überprüfen mit sample():
df_copy.loc['2013'].sample(5)

            Consumption     Wind    Solar
Date
2013-12-29     1031.149  213.978   20.933
2013-10-21     1365.215  166.227   59.546
2013-05-16     1305.024  104.930  114.320
2013-11-18     1422.174   53.486   21.503
2013-06-17     1296.348   45.483  195.625

In [233]:
# alle Daten aus dem März 2014:
df_copy.loc['2014-03']

            Consumption     Wind    Solar
Date
2014-03-01     1310.863   42.380   74.222
2014-03-02     1205.382   79.034   58.509
2014-03-03     1479.361  174.177   83.837
2014-03-04     1521.878   19.160   70.862
2014-03-05     1550.944   18.679   74.279
2014-03-06     1546.473   54.556   91.283
2014-03-07     1514.897  114.278  120.060
2014-03-08     1279.162  107.357  131.284
2014-03-09     1161.496  175.888  145.585
2014-03-10     1479.230   94.246  145.402
2014-03-11     1521.112  113.199  138.730
2014-03-13     1510.033   22.425  147.203
2014-03-14     1488.044  122.019  135.133
2014-03-15     1303.214  510.579   46.959
2014-03-16     1199.315  538.519   33.936
2014-03-17     1498.042  354.408   84.790
2014-03-18     1528.932  215.012   78.960
2014-03-19     1524.762  405.654   66.495
2014-03-20     1498.548  311.326  160.777
2014-03-21     1474.562  289.345  114.934
2014-03-22     1280.873  147.024   63.536
2014-03-23     1176.870   71.096   59.828
2014-03-24     1499.180   27.402   84.584
2014-03-25     1521.834   39.216  107.847
2014-03-26     1522.582   94.095  131.795
2014-03-27     1510.903  192.194  156.117
2014-03-28     1470.810  110.056  121.595
2014-03-31     1446.114   14.138  112.798

In [237]:
# Überprüfen mit head:
df_copy.loc['2014-03'].head()

            Consumption     Wind   Solar
Date
2014-03-01     1310.863   42.380  74.222
2014-03-02     1205.382   79.034  58.509
2014-03-03     1479.361  174.177  83.837
2014-03-04     1521.878   19.160  70.862
2014-03-05     1550.944   18.679  74.279

In [238]:
# Überprüfen mit tail:
df_copy.loc['2014-03'].tail()

            Consumption     Wind    Solar
Date
2014-03-25     1521.834   39.216  107.847
2014-03-26     1522.582   94.095  131.795
2014-03-27     1510.903  192.194  156.117
2014-03-28     1470.810  110.056  121.595
2014-03-31     1446.114   14.138  112.798

In [239]:
# alle Daten von März 2014 bis Februar 2015:
df_copy.loc['2014-03':'2015-02']

            Consumption     Wind    Solar
Date
2014-03-01     1310.863   42.380   74.222
2014-03-02     1205.382   79.034   58.509
2014-03-03     1479.361  174.177   83.837
2014-03-04     1521.878   19.160   70.862
2014-03-05     1550.944   18.679   74.279
...                 ...      ...      ...
2015-02-24     1604.991  317.556   50.806
2015-02-25     1585.249  107.047   72.248
2015-02-26     1579.350  177.505  106.263
2015-02-27     1569.187  136.122   65.845
2015-02-28     1340.489  207.350   82.594

[362 rows x 3 columns]

In [240]:
# Überprüfen mit head:
df_copy.loc['2014-03':'2015-02'].head()

            Consumption     Wind   Solar
Date
2014-03-01     1310.863   42.380  74.222
2014-03-02     1205.382   79.034  58.509
2014-03-03     1479.361  174.177  83.837
2014-03-04     1521.878   19.160  70.862
2014-03-05     1550.944   18.679  74.279

In [241]:
# Überprüfen mit tail:
df_copy.loc['2014-03':'2015-02'].tail()

            Consumption     Wind    Solar
Date
2015-02-24     1604.991  317.556   50.806
2015-02-25     1585.249  107.047   72.248
2015-02-26     1579.350  177.505  106.263
2015-02-27     1569.187  136.122   65.845
2015-02-28     1340.489  207.350   82.594

## Mit Zeitstempel und Spaltenname indexieren

In [245]:
# Der Energieverbrauch (Consumption) in den Jahren 2014 bis 2015:
df_copy['Consumption'].loc['2014':'2015']

Date
2014-01-01    1080.080
2014-01-02    1343.101
2014-01-03    1379.776
2014-01-04    1271.029
2014-01-05    1182.416
                ...
2015-12-27    1068.214
2015-12-28    1219.075
2015-12-29    1233.660
2015-12-30    1238.863
2015-12-31    1158.103
Name: Consumption, Length: 727, dtype: float64

In [246]:
# Spalten "Solar" und "Wind" am 01.12.2013:
df_copy[['Solar', 'Wind']].loc['2013-12-01']

Solar     24.464
Wind     211.319
Name: 2013-12-01 00:00:00, dtype: float64